Repository: kamilarybakova/Lexi---learning-app
Catalog: lib/l10n/app_*.arb
Languages: ky

source: Add words
ky: Сөз кошуу

source: Dictionary
ky: Сөздүк

# emptyDictionaryTitle
source: Dictionary is empty
ky: Сөздүк бош

# emptyDictionarySubtitle
source: Add your first words to start learning
ky: Үйрөнүүнү баштоо үчүн биринчи сөздөрдү кошуңуз

# searchHint
source: Search words
ky: Сөз издөө

# todayTraining
source: Today's training
ky: Бүгүнкү машыгуу

# wordsWaiting
source: {count} words waiting for you
ky: {count} сөз сизди күтүп турат

# greetingMorning
source: Good morning ☀️
ky: Кутмандуу таң ☀️

# greetingAfternoon
source: Good afternoon 🌤️
ky: Кутмандуу күн 🌤️

# greetingEvening
source: Good evening 🌅
ky: Кутмандуу кеч 🌅

# greetingNight
source: Good night 🌙
ky: Кутмандуу түн 🌙

# dashboardSubtitle
source: Let's learn some words
ky: Сөздөрдү үйрөнөлү

# todayProgress
source: Today's progress
ky: Бүгүнкү прогресс

# wordsLearned
source: {learned} of {total} words learned
ky: {total} ичинен {learned} сөз үйрөнүлдү

source: Profile
ky: Профиль

source: Language
ky: Тил

source: Learning
ky: Үйрөнүү

source: Learning goal
ky: Үйрөнүү максаты

# goalTravel
source: Travel
ky: Саякат

source: Learning language
ky: Үйрөнүү тили

source: Notifications
ky: Билдирмелер

source: Daily reminder
ky: Күнүмдүк эскертүү

source: Preferences
ky: Жөндөөлөр

source: Pronunciation
ky: Айтылышы

source: Data
ky: Маалыматтар

source: Export words
ky: Сөздөрдү экспорттоо

source: Reset progress
ky: Прогрессти башынан баштоо

source: App
ky: Колдонмо

# about
source: About app
ky: Колдонмо жөнүндө

# authTitle
source: Sign in to add words
ky: Сөз кошуу үчүн кириңиз

# authSubtitle
source: Create an account to save your words, sync them between devices and use AI features.
ky: Сөздөрдү сактоо, түзмөктөр ортосунда синхрондоштуруу жана ИИ функцияларын колдонуу үчүн аккаунт түзүңүз.

# authFeatureSync
source: Sync words between devices
ky: Сөздөрдү түзмөктөр ортосунда синхрондоштуруу

# authFeatureAI
source: AI translation and automatic categorization
ky: ИИ аркылуу которуу жана автоматтык категориялоо

# authFeatureSecurity
source: Secure cloud storage
ky: Коопсуз булут сактагыч

# authGoogle
source: Continue with Google
ky: Google аркылуу кирүү

# authLater
source: Maybe later
ky: Кийинчерээк

source: Scan from photo
ky: Сүрөттөн сканерлөө

source: Add manually
ky: Кол менен кошуу

source: Paste text
ky: Текстти чаптоо

# manualInputHint
source: Enter one or more words (each on a new line)
ky: Бир же бир нече сөз жазыңыз (ар бирин жаңы саптан)

source: Check
ky: Текшерүү

source: Detected words
ky: Табылган сөздөр

# scanText
source: Scan
ky: Сканерлөө

# scan
source: Scan text
ky: Текстти сканерлеңиз

source: Scan error
ky: Сканерлөөдө ката кетти

# reviewWordsTitle
source: Review words ({count})
ky: Сөздөрдү текшерүү ({count})

# addWordsButton
source: Add {count} words
ky: {count} сөз кошуу
